gallium_2D/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PorousFile          "porous_media.txt";
coordinateScaler    1.e-3;

rhoRef              rhoRef [1 -3 0 0 0 0 0] 6093.00;
rhopore             rhpore [1 -3 0 0 0 0 0] 2700.00;

k                   k [1 1 -3 -1 0 0 0] 32.00;
kpore               kpore [1 1 -3 -1 0 0 0] 237.00;

mu                  mu [1 -1 -1 0 0 0 0] 1.81e-03;

Cp                  Cp [0 2 -2 -1 0 0 0] 381.50;
Cppore              Cppore [0 2 -2 -1 0 0 0] 900;

L 		            L [0 2 -2 0 0 0 0] 80160;

Tmelt 		        Tmelt [0 0 0 1 0 0 0] 302.93;

Tl                  Tl [0 0 0 1 0 0 0] 302.93;

Ts                  Ts [0 0 0 1 0 0 0] 302.93;

C 		            C [1 -3 -1 0 0 0 0] 1.6e+06;

glRelax 	        glRelax [0 0 0 0 0 0 0] 0.9;

q 	                q [0 0 0 0 0 0 0] 1e-3;

// ************************************************************************* //
