gallium_2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 2.9706e-07;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 1.2e-04;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 302.93;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 0.02157;

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 1.0;


// ************************************************************************* //
